In [51]:
%run -i 04_add_delete.ipynb

## Manejo de datos nulos


Los datos nulos son dolores de cabeza para este mundo de la ciencia de datos y se van a encontrar mucho en nuestros DataFrames

* Creamos un DataFrame con algunos valores nulos

In [52]:
dict = {'Col1':[1,2,3,np.nan],
'Col2':[4, np.nan,6,7],
'Col3':['a','b','c', None]}

In [53]:
df=pd.DataFrame(dict) # create a dataframe
df

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   NaN     b
2   3.0   6.0     c
3   NaN   7.0  None

* Identificar valores nulos en un DataFrame

In [54]:
df.isnull() # check for missing values, we can use isna() as well

    Col1   Col2   Col3
0  False  False  False
1  False   True  False
2  False  False  False
3   True  False   True

Identificar valores nulos con un valor numérico

In [55]:
df.isnull() *1 # convert the boolean to 0 and 1

   Col1  Col2  Col3
0     0     0     0
1     0     1     0
2     0     0     0
3     1     0     1

Sustituir los valores nulos por una cadena

In [56]:
df.fillna("Missing") # fill missing values with a string, in this case "Missing"

      Col1     Col2     Col3
0      1.0      4.0        a
1      2.0  Missing        b
2      3.0      6.0        c
3  Missing      7.0  Missing

* Sustituir valores nulos por una medida estadística realizada con los valores de las columnas

In [57]:
numeric_cols=df.select_dtypes(include=np.number) # select numeric columns, we use select_dtypes to select columns based on their data type, in this case we select numeric columns using np.number


mean_values=numeric_cols.mean() # calculate the mean of each column and save it in a variable
mean_values

df[numeric_cols.columns]=numeric_cols.fillna(mean_values) # fill missing values with the mean of each column
df

   Col1      Col2  Col3
0   1.0  4.000000     a
1   2.0  5.666667     b
2   3.0  6.000000     c
3   2.0  7.000000  None

Sustituir valores nulos por valores de interpolación

In [58]:
df.interpolate() # fill missing values with the previous value

   Col1      Col2  Col3
0   1.0  4.000000     a
1   2.0  5.666667     b
2   3.0  6.000000     c
3   2.0  7.000000  None

Eliminar valores nulos

In [59]:
df.dropna() # drop rows with missing values

   Col1      Col2 Col3
0   1.0  4.000000    a
1   2.0  5.666667    b
2   3.0  6.000000    c